const allProduct = [
    {
        name: "Black-knobbed map turtle",
        id: 1,
        price: 3500,
        img: '<img src="../img/Black knob.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-10%",
        new_price: 3150,
        star: "4.2",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",
        voutcher_name: "Monday Happy",
        voutcher_code: "#MONHPY",
        voutcher_percent: "5%",
    },
    {
        name: "Diamondback terrapins",
        id: 2,
        price: 8000,
        img: '<img src="img/Diamond-black.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-5%",
        new_price: 7200,
        star: "4.8",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Tuesday Surprise",
        voutcher_code: "#TUEDYSRPSPY",
        voutcher_percent: "10%",
    },
    {
        name: "Black pond turtle",
        id: 3,
        price: 1200,
        img: '<img src="/img/Hamilton.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-10%",
        new_price: 1080,
        star: "4.5",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "First Order",
        voutcher_code: "#HPYFRST",
        voutcher_percent: "5%",
    },
    {
        name: "Mississippi map turtle",
        id: 4,
        price: 1500,
        img: '<img src="/img/Missisippi.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-15%",
        new_price: 1275,
        star: "4.4",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Hot Wednesday",
        voutcher_code: "#HTWEDDY",
        voutcher_percent: "10%",
    },
    {
        name: "Nicaraguan slider",
        id: 5,
        price: 900,
        img: '<img src="/img/Peacock.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-5%",
        new_price: 855,
        star: "4.1",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Thursday Goodday",
        voutcher_code: "#THUDYGDDY",
        voutcher_percent: "20%",
    },
    {
        name: "Pig-nosed turtle",
        id: 6,
        price: 2500,
        img: '<img src="img/Pig-nose.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-5%",
        new_price: 2375,
        star: "4.5",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Friday Crazy",
        voutcher_code: "#FRIDYCZY",
        voutcher_percent: "15%",
    },
    {
        name: "Northern red-bellied cooter",
        id: 7,
        price: 950,
        img: '<img src="/img/Red-Bellied Side-Necked.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-10%",
        new_price: 855,
        star: "4.7",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Welcome Comback",
        voutcher_code: "#WLCMCMBK",
        voutcher_percent: "10%",
    },
    {
        name: "Rio Grande cooter",
        id: 8,
        price: 1200,
        img: '<img src="/img/Riogrand.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-10%",
        new_price: 1080,
        star: "4.5",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Bright Saturday",
        voutcher_code: "#BRGTSATDY",
        voutcher_percent: "5%",
    },
    {
        name: "Chinese pond turtle",
        id: 9,
        price: 500,
        img: '<img src="/img/Reeves.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-5%",
        new_price: 475,
        star: "4.3",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Sunday Funday",
        voutcher_code: "#SUNDYFUNDY",
        voutcher_percent: "5%",
    },
    {
        name: "Yellow-spotted Amazon river turtle",
        id: 10,
        price: 1800,
        img: '<img src="img/Yellow-spot.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-10%",
        new_price: 1620,
        star: "4.4",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "End of month",
        voutcher_code: "#ENOFFMNT",
        voutcher_percent: "10%",
    },
    {
        name: "Sulcata tortoise",
        id: 11,
        price: 1500,
        img: '<img src="/img/Sulcata.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-15%",
        new_price: 1275,
        star: "4.8",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Beginning of the month",
        voutcher_code: "#BEGOFFTMNT",
        voutcher_percent: "10%",
    },
    {
        name: "Leopard tortoise",
        id: 12,
        price: 4500,
        img: '<img src="/img/Leopard.jpg" class="img-fluid rounded thumbnail-image">',
        discount: "-10%",
        new_price: 4050,
        star: "4.6",
        modal_1: "<strong>Black-knobbed map turtle</strong> หรือ เต่าแผนที่ปุ่มสีดำ หรือ เต่าใบเลื่อยปุ่มสีดำ มีถิ่นกำเนิดทางตะวันออกเฉียงใต้ของสหรัฐอเมริกา โดยในรัฐอลาบามาพวกมันถูกพบในบริเวณระบายน้ำของอ่าวโมบาย(Mobile Bay) ในรัฐมิสซิสซิปปี้พบได้ในแม่น้ำTombigbee และในแม่น้ำBlack Warriorที่ถูกพบได้ตามแม่น้ำเพราะพวกมันสามารถอยู่รอดได้ในน้ำจืดเท่านั้น",
        modal_2: "เป็นเต่าน้ำขนาดเล็กถึงขนาดกลาง มีผิวสีเทาอ่อน กระดองจะมีลักษณะเป็นโดมมีสันกระดองสี่ชิ้นยื่นออกมา ปลายสันทั้งสี่จะมีสำดำ เกล็ดบนกระดองจะมีลวดลายวงกลมสีเขียวและเหลืองอยู่ภายใน เส้นของนอกของเกล็ดจะเป็นสีดำ บริเวณหัวจะเป็นสีน้ำตาลเข้ม และมีลายสีเหลือง ไปจนถึงบริเวณขา เมื่อโตเต็มวัยตัวเมียจะมีขนาดใหญ่กว่าตัวผู้สองเท่าแต่สันสีดำทั้งสี่ชิ้นของตัวผู้จะยื่นออกมามากกว่า หางและเล็บของตัวผู้จะมีขนาดยาวกว่าตัวเมีย ความยาวกระดองเมื่อโตเต็มวัยของตัวผู้ ประมาณ 3-4นิ้ว ของตัวเมีย ประมาณ 4-7.5 นิ้ว",
        modal_3: "ตามธรรมชาติ Black-knobbed map turtleจะออกหากินตามฤดูกาลตั้งแต่เดือนเมษายนถึงปลายเดือนพฤศจิกายนในทุกๆวันเต่าจะมีการขึ้นมาพักอาบแดด ในช่วงเช้าตรู่หรือช่วงบ่ายเพื่อควบคุมอุณหภูมิในร่างกาย รวมไปถึงช่วยในการดูดซึมและย่อยอาหารทำให้เต่าที่อาบแดดเป็นประจำจะตัวโตกว่า ตัวผู้มีอายุประมาณ 3-4 ปี ตัวเมียมีอายุประมาณ7-8 ปี ตัวเมียวางไข่ได้มากสุด 5 ฟองและสามารถวางไข่ได้ 3-4 ฟองในหนึ่งปีการทำรังเกิดขึ้นตั้งแต่เดือนพฤษภาคมถึงเดือนสิงหาคม และเกิดขึ้นในเวลากลางคืนบนสันทราย <br><strong>ข้อแนะนำในการเลี้ยง</strong> <br> - พื้นที่เลี้ยงควรมีบริเวณที่เป็นบก เอาไว้ให้เต่าขึ้นมาพักและอาบแดดด้วย <br>- คุณลูกค้าที่จะนำไปเลี้ยงในคอนโดจึงควรนำเต่าออกมาอาบแดดในทุกๆวันด้วยนะครับแต่ถ้าไม่สะดวกควรมีโคมไฟUVAและUVBเปิดให้เต่าแทน <br>- ถ้าในห้องเปิดแอร์แนะนำว่าเปิดโคมไฟให้เต่าด้วยนะครับ <br>- พื้นที่เลี้ยงควรมีใบไม้แห้งใบใหญ่ๆ ขอนไม้ หรือที่หลบเอาไว้ให้เต่าด้วยเพื่อให้เต่าไม่เครียดและรู้สึกปลอดภัย เพราะเมื่อถูกเข้าใกล้เต่าจะรีบลงน้ำไปหาที่กำบัง <br>- อาหารแนะนำเป็นอาหารเม็ดสำหรับเต่า เพราะมีความสะอาดมากกว่าอาหารสด มีสารอาหารครบถ้วนหาซื้อและเก็บรักษาง่ายกว่า",

        voutcher_name: "Middle of the month",
        voutcher_code: "#MIDOFFTMNT",
        voutcher_percent: "10%",
    },
];

const containerAlllist = document.getElementById("containerallproduct");
const clickBoxSearch = document.getElementById("inputBoxSearch");          
const turtlefromselect = document.getElementById("input-box");

var cart = [];

clickBoxSearch.onclick = function () {
    let selectTurtle = turtlefromselect.value;
    console.log(selectTurtle);
    let checkturtle = allProduct.filter((keyword) => {
        return keyword.name == selectTurtle
    });
    console.log(checkturtle);
    if (checkturtle.length) {
        showSelectTurtle(checkturtle)
    }
};

function showSelectTurtle(checkturtle) {
    const card = checkturtle.map((i) => {
        return (
            "<div class='containerselectturtle'>" +
                "<div class='cardallproduct'>" +
                    "<div class='image-container'>" +
                        "<div class='first'>" +
                            "<div class='d-flex justify-content-between align-items-center'>" +
                                "<span class='discount'>" +
                                    i.discount +
                                "</span>" +
                                "<span class='wishlist'>" +
                                    "<ion-icon name='heart'></ion-icon>" +
                                "</span>" +
                            "</div>" +
                        "</div>" +
                        i.img +
                    "</div>" +
                    "<div class='product-detail-container p-2'>" +
                        "<div class='d-flex justify-content-between align-items-start'>" +
                            "<h5 class='turtle-name'>" +
                                i.name +
                            "</h5>" +
                            "<div class='d-flex flex-column mb-2'>" +
                                "<span class='new-price'>" +
                                    "฿" +
                                    i.new_price +
                                "</span>" +
                                "<small class='old-price text-right'>" +
                                    "฿" +
                                    i.price +
                                "</small>" +
                            "</div>" +
                        "</div>" +
                        "<div class='d-flex justify-content-between align-items-center pt-1'>" +
                            "<div class='d-flex'>" +
                                "<span class='item-size btn female_btn' type='button'>" +
                                    "<ion-icon name='female-outline'></ion-icon>" +
                                "</span>" +
                                "<span class='item-size btn male_btn' type='button'>" +
                                    "<ion-icon name='male-outline'></ion-icon>" +
                                "</span>" +
                            "</div>" +
                            "<button class='btn_detail' data-bs-toggle='modal' data-bs-target='#exampleModal'>" +
                                "Detail" +
                            "</button>" +
                            "<div class='modal fade' id='exampleModal' tabindex='-1' aria-labelledby='exampleModalLabel' aria-hidden='true'>" +
                                "<div class='modal-dialog modal-dialog-centered'>" +
                                    "<div class='modal-content'>" +
                                        "<div class='modal-header'>" +
                                            "<h1 class='modal-title fs-5' id='exampleModalLabel'>" +
                                                i.name +
                                            "</h1>" +
                                            "<button type='button' class='btn-close' data-bs-dismiss='modal' aria-label='Close'>" +
                                        "</div>" +
                                        "<div class='modal-body'>" +
                                            "<div class='accordion' id='accordionPanelsStayOpenExample'>" +
                                                "<div class='accordion-item'>" +
                                                    "<h2 class='accordion-header'>" +
                                                        "<button class='accordion-button' type='button' data-bs-toggle='collapse' data-bs-target='#panelsStayOpen-collapseOne' aria-expanded='true' aria-controls='panelsStayOpen-collapseOne'>" +
                                                            "ถิ่นกำเนิด" +
                                                        "</button>" +
                                                    "</h2>" +
                                                    "<div id='panelsStayOpen-collapseOne' class='accordion-collapse collapse show'>" +
                                                        "<div class='accordion-body'>" +
                                                            i.modal_1 +
                                                        "</div>" +
                                                    "</div>" +
                                                "</div>" +
                                                "<div class='accordion-item'>" +
                                                    "<h2 class='accordion-header'>" +
                                                        "<button class='accordion-button collapsed' type='button' data-bs-toggle='collapse' data-bs-target='#panelsStayOpen-collapseTwo' aria-expanded='false' aria-controls='panelsStayOpen-collapseTwo'>" +
                                                            "ลักษณะภายนอก" +
                                                        "</button>" +
                                                    "</h2>" +
                                                    "<div id='panelsStayOpen-collapseTwo' class='accordion-collapse collapse'>" +
                                                        "<div class='accordion-body'>" +
                                                            i.modal_2 +
                                                        "</div>" +
                                                    "</div>" +
                                                "</div>" +
                                                "<div class='accordion-item'>" +
                                                    "<h2 class='accordion-header'>" +
                                                        "<button class='accordion-button collapsed' type='button' data-bs-toggle='collapse' data-bs-target='#panelsStayOpen-collapseThree' aria-expanded='false' aria-controls='panelsStayOpen-collapseThree'>" +
                                                            "ที่อยู่อาศัยและพฤติกรรม" +
                                                        "</button>" +
                                                    "</h2>" +
                                                    "<div id='panelsStayOpen-collapseThree' class='accordion-collapse collapse'>" +
                                                        "<div class='accordion-body'>" +
                                                            i.modal_3 +
                                                        "</div>" +
                                                    "</div>" +
                                                "</div>" +
                                            "</div>" +
                                        "</div>" +
                                        "<div class='modal-footer'></div>" +
                                    "</div>" +
                                "</div>" +
                            "</div>" +
                        "</div>" +
                        "<div class='d-flex justify-content-between align-items-center pt-1'><div>" +
                            "<i class='fa fa-star-o rating-star'></i>" +
                            "<span class='rating-number'>" +
                                i.star +
                            "</span>" +
                        "</div>" +
                        "<span class='buy'>"+
                            "<button type='button' onclick='addtocart("+ JSON.stringify(i)+ ")' class='btn-cartinmodal'>" +
                                "<img src='/img/Cart icon.png' width='20px' height='20px'>" +
                            "</button>"+
                        "</span>"+
                    "</div>" +
                "</div>" +
            "</div>"
        );
    });
    containerAlllist.innerHTML = card;
}

function Showproduct(allProduct) {
    const card = allProduct.map((i) => {
        return (
            "<div class='container-grid-item'>" +
                "<div class='cardallproduct'>" +
                    "<div class='image-container'>" +
                        "<div class='first'>" +
                            "<div class='d-flex justify-content-between align-items-center'>" +
                                "<span class='discount'>" +
                                    i.discount +
                                "</span>" +
                                "<span class='wishlist'>" +
                                    "<ion-icon name='heart'>" +
                                    "</ion-icon>" +
                                "</span>" +
                            "</div>" +
                        "</div>" +
                        i.img +
                    "</div>" +
                    "<div class='product-detail-container p-2'>" +
                        "<div class='d-flex justify-content-between align-items-start'>" +
                            "<h5 class='turtle-name'>" +
                                i.name +
                            "</h5>" +
                            "<div class='d-flex flex-column mb-2'>" +
                                "<span class='new-price'>" +
                                    "฿" +
                                    i.new_price +
                                "</span>" +
                                "<small class='old-price text-right'>" +
                                    "฿" +
                                    i.price +
                                "</small>" +
                            "</div>" +
                        "</div>" +
                        "<div class='d-flex justify-content-between align-items-center pt-1'>" +
                            "<div class='d-flex'>" +
                                "<span class='item-size btn female_btn' type='button'>" +
                                    "<ion-icon name='female-outline'>" +
                                    "</ion-icon>" +
                                "</span>" +
                                "<span class='item-size btn male_btn' type='button'>" +
                                    "<ion-icon name='male-outline'>" +
                                    "</ion-icon>" +
                                "</span>" +
                            "</div>" +
                            "<button class='btn_detail' data-bs-toggle='modal' data-bs-target='#exampleModal"+i.id+"'>" +
                                "Detail" +
                            "</button>" +
                            "<div class='modal fade' id='exampleModal"+i.id+"' tabindex='-1' aria-labelledby='exampleModalLabel' aria-hidden='true'>" +
                                "<div class='modal-dialog modal-dialog-centered'>" +
                                    "<div class='modal-content'>" +
                                        "<div class='modal-header'>" +
                                            "<h1 class='modal-title fs-5' id='exampleModalLabel'>" +
                                                i.name +
                                            "</h1>" +
                                            "<button type='button' class='btn-close' data-bs-dismiss='modal' aria-label='Close'>" +
                                        "</div>" +
                                        "<div class='modal-body'>" +
                                            "<div class='accordion' id='accordionPanelsStayOpenExample'>" +
                                                "<div class='accordion-item'>" +
                                                    "<h2 class='accordion-header'>" +
                                                        "<button class='accordion-button' type='button' data-bs-toggle='collapse' data-bs-target='#panelsStayOpen-collapseOne' aria-expanded='true' aria-controls='panelsStayOpen-collapseOne'>" +
                                                            "ถิ่นกำเนิด" +
                                                        "</button>" +
                                                    "</h2>" +
                                                    "<div id='panelsStayOpen-collapseOne' class='accordion-collapse collapse show'>" +
                                                        "<div class='accordion-body'>" +
                                                            i.modal_1 +
                                                        "</div>" +
                                                    "</div>" +
                                                "</div>" +
                                                "<div class='accordion-item'>" +
                                                    "<h2 class='accordion-header'>" +
                                                        "<button class='accordion-button collapsed' type='button' data-bs-toggle='collapse' data-bs-target='#panelsStayOpen-collapseTwo' aria-expanded='false' aria-controls='panelsStayOpen-collapseTwo'>" +
                                                            "ลักษณะภายนอก" +
                                                        "</button>" +
                                                    "</h2>" +
                                                    "<div id='panelsStayOpen-collapseTwo' class='accordion-collapse collapse'>" +
                                                        "<div class='accordion-body'>" +
                                                            i.modal_2 +
                                                        "</div>" +
                                                    "</div>" +
                                                "</div>" +
                                                "<div class='accordion-item'>" +
                                                    "<h2 class='accordion-header'>" +
                                                        "<button class='accordion-button collapsed' type='button' data-bs-toggle='collapse' data-bs-target='#panelsStayOpen-collapseThree' aria-expanded='false' aria-controls='panelsStayOpen-collapseThree'>" +
                                                            "ที่อยู่อาศัยและพฤติกรรม" +
                                                        "</button>" +
                                                    "</h2>" +
                                                    "<div id='panelsStayOpen-collapseThree' class='accordion-collapse collapse'>" +
                                                        "<div class='accordion-body'>" +
                                                            i.modal_3 +
                                                        "</div>" +
                                                    "</div>" +
                                                "</div>" +
                                            "</div>" +
                                        "</div>" +
                                        "<div class='modal-footer'>" +
                                        "</div>" +
                                    "</div>" +
                                "</div>" +
                            "</div>" +
                        "</div>" +
                        "<div class='d-flex justify-content-between align-items-center pt-1'>" +
                            "<div>" +
                                "<i class='fa fa-star-o rating-star'>" +
                                "</i>" +
                                "<span class='rating-number'>" +
                                    i.star +
                                "</span>" +
                            "</div>" +
                            "<span class='buy'>"+
                                "<button type='button' onclick='addtocart("+ JSON.stringify(i)+ ")' class='btn-cartinmodal'>" +
                                    "<img src='/img/Cart icon.png' width='20px' height='20px'>" +
                                "</button>"+
                            "</span>"+
                        "</div>" +
                    "</div>" +
                "</div>" +
            "</div>"

        );
    });
    containerAlllist.innerHTML = card;
}

function addtocart(i) {
    cart.push({...i});
    displaycart();
}

function delElement(i) {
    cart.splice(i, 1);
    displaycart();
}

function displaycart() {
    
    document.getElementById("count").innerHTML = cart.length;

    let j = 0, total = 0;
    if (cart.length == 0) {
        document.getElementById('cartItem').innerHTML = "Your cart is empty";
        document.getElementById("total").innerHTML = "฿ " + 0 + ".00";
    }
    else {
        document.getElementById("cartItem").innerHTML = cart.map((item) => {
            total = total + item.new_price;
            document.getElementById("total").innerHTML = "฿ " + total + ".00";
            return (
                "<div class='cart-item'>" +
                    "<div class='row-img'>" +
                        "<div class='rowimg'>" +
                            item.img +
                        "</div>" +
                    "</div>" + 
                    "<p class='textincart'style='font-size:12px;'>" +
                        item.name +
                    "</p>" +
                    "<h2 class='priceincart' style='font-size: 16px;'>" +
                        "฿ " +
                        item.new_price +
                    "</h2>" +
                    "<i class='fa-solid fa-trash' onclick='delElement(" + (j++) + ")'></i>" +
                "</div>"
            );
        }).join('');
    };
}

Showproduct(allProduct);






